//: Playground - noun: a place where people can play

import UIKit

/*:
 # Life is Tech! SCHOOL
 # iPhoneコース しのきん班宿題
 ## 提出期限 7/13(水)
 */
/*:
 ## プログラミング基礎（記述式）
 */

//Q: Swiftのデータ型で整数、文字列、小数を表すデータ型をそれぞれ答えてください
/*解答:
 整数:
 文字列:
 小数:
 */

//Q: 乱数を出すためのメソッドを答えてください。
//解答:

//Q: メソッドを宣言するときに、以下のように宣言しますが、AとBに対応するところは、メソッドの何というでしょうか?
/*
 func name(A) -> B {
 }
 */
//: 解答: A:
//: 解答: B:

//Q: オプショナルという概念を使って、以下のコードになぜエラーが発生するか答えてください。
//let country: String
//country = nil
/*解答:
 
 
 
 */

//: Q: クラス内の変数とStoryBoard上の部品を関連付けするために必要な宣言はなんでしょう。カッコ内を埋めてください。
// ( ) weak var label: UILabel!
//: Q: クラス内の関数とStoryBoard上での動作を関連付けするために必要な宣言はなんでしょう。1つ目のカッコ内を埋めてください。
// ( ) func plus() { }

//Q: ボタンと関連付けるときに選ぶUIControlEventはなんでしょうか？カッコの中にはいるのはなんでしょうか？
// Touch(    )


//Q: Swiftの列挙型を答えてください。
//解答:

//Q: UIImageとUIImageViewの関係をわかりやすく説明してください。
/*解答:
 
 
 
 */

//Q: let array: [Int] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]を宣言した時、2番目の要素はなんですか？
//解答:


/*
 ## Swift（実技）
 */
//Q: NSUserDefaultsを宣言してください。もしくは、NSUserDefaultsにアクセスしてください。

//: Q: さきほど宣言したNSUserDefaultsに「meat」というキーで、「からあげ」という文字列を保存してください。

//: Q: 「meat」という定数に、さきほど保存したデータを取得して代入してください。

//: Q: Bool型の変数を、値をtrueで宣言してください。

//: Q: 上で宣言したBool型の変数が、trueなら「真」と表示し、falseなら「偽」と表示するswitch文を書いてください

//: Q: 数字を引数に取り、偶数の時のみ表示するメソッドを宣言してください。

//: Q: 0~20の範囲でfor文を回し、上で宣言したメソッドを使って、偶数のみ表示してください。

//: Q: Int型を要素に取る配列を宣言してください。

//: Q: 上で宣言した配列の長さ(要素数)を表示してください。

//: Q: 上で宣言した配列に要素として0を追加してください。

//: Q: 上で宣言した配列内のデータすべてを表示してください

//: Q: Int型を引数に取り、Int型を要素とする配列を戻り値に取るメソッドを宣言してください。またそのメソッドの処理として、引数が偶数の時のみ、戻り値の配列に追加してください。

//: Q: しのきん(21)、とうよう(21)のデータを、keyを名前、valueを年齢として辞書型で宣言してください

//: Q: 自分の名前と年齢のデータを追加してください

//: Q: 辞書内のデータすべてを「[名前]は[年齢]歳です。」というふうに表示するコードを書いてください

//: Q: 整数型の配列を引数として平均値を出力する関数を作ってください。

//: Q: 上で宣言した関数で、辞書内のデータの年齢の平均値を求めてください。

/*:
 ## アンケート
 - 難しかった
 - ふつう
 */

/*
 */
//
